<a href="https://colab.research.google.com/github/magrosskopf/EA4/blob/main/Untitled0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
url = "https://raw.githubusercontent.com/edlich/eternalrepo/master/DS-WAHLFACH/countries.csv"
df = pd.read_csv(url)
print("Load the countries.csv directly via URL import into your panda data frame!: ")
df

Load the countries.csv directly via URL import into your panda data frame!:

       Name     People     Area   BIP Currency
0   Germany   82521653   357385  3466      EUR
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

In [ ]:
print("Size of Matrix")
df.shape

Size of Matrix

(5, 5)

In [ ]:
print("Display some basic information as rows, columns and some basic statistical info")
df.describe()

Display some basic information as rows, columns and some basic statistical info

             People          Area         BIP
count  5.000000e+00  5.000000e+00     5.00000
mean   1.027863e+08  3.907400e+06  2716.20000
std    6.759970e+07  4.904957e+06  1457.86083
min    3.650310e+07  3.013380e+05  1529.00000
25%    6.050172e+07  3.573850e+05  1798.00000
50%    8.252165e+07  3.778350e+05  1850.00000
75%    1.260450e+08  8.515770e+06  3466.00000
max    2.083600e+08  9.984670e+06  4938.00000

In [ ]:
print("Show the last 4 rows of the data frame")
df.tail(4)

Show the last 4 rows of the data frame

       Name     People     Area   BIP Currency
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

In [ ]:
print("Show all the row of countries who have the EURO")
df[df["Currency"] == "EUR"]

Show all the row of countries who have the EURO

      Name    People    Area   BIP Currency
0  Germany  82521653  357385  3466      EUR
3    Italy  60501718  301338  1850      EUR

In [ ]:
print("Show only name and Currency in a new data frame")
df.loc[:, ["Name", "Currency"]]

Show only name and Currency in a new data frame

       Name Currency
0   Germany      EUR
1     Japan      YEN
2    Canada      CAD
3     Italy      EUR
4  Brazilia     REAL

In [ ]:
print("Show only the rows/countries that have more than 2000 BIP (it is in Milliarden USD Bruttoinlandsprodukt)")
df[df["BIP"] > 2000]

Show only the rows/countries that have more than 2000 BIP (it is in Milliarden USD Bruttoinlandsprodukt)

      Name     People    Area   BIP Currency
0  Germany   82521653  357385  3466      EUR
1    Japan  126045000  377835  4938      YEN

In [ ]:
print("Select all countries where with inhabitants between 50 and 150 Mio")
df[(df.People > 50000000) & (df.People < 150000000)]

Select all countries where with inhabitants between 50 and 150 Mio

      Name     People    Area   BIP Currency
0  Germany   82521653  357385  3466      EUR
1    Japan  126045000  377835  4938      YEN
3    Italy   60501718  301338  1850      EUR

In [ ]:
print("Change BIP to Bip")
df.rename(columns={"BIP":"Bip"})

Change BIP to Bip

       Name     People     Area   Bip Currency
0   Germany   82521653   357385  3466      EUR
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

In [ ]:
print("Calculate the Bip sum")
df.BIP.sum()

Calculate the Bip sum

13581

In [ ]:
print("Calculate the average people of all countries")
df.People.mean()

Calculate the average people of all countries

102786293.6

In [ ]:
print("Sort by name alphabetically")
df.sort_values(by="Name")

Sort by name alphabetically

       Name     People     Area   BIP Currency
4  Brazilia  208360000  8515770  1798     REAL
2    Canada   36503097  9984670  1529      CAD
0   Germany   82521653   357385  3466      EUR
3     Italy   60501718   301338  1850      EUR
1     Japan  126045000   377835  4938      YEN

In [ ]:
print("Create a new data frame from the original where the area is changed as follows: all countries with > 1000000 get BIG and <= 1000000 get SMALL in the cell replaced!")
df2 = df.copy()
df2['Area'] = df['Area'].apply(lambda x: 'BIG' if x > 1000000 else 'SMALL')
df2

Create a new data frame from the original where the area is changed as follows: all countries with > 1000000 get BIG and <= 1000000 get SMALL in the cell replaced!

       Name     People   Area   BIP Currency
0   Germany   82521653  SMALL  3466      EUR
1     Japan  126045000  SMALL  4938      YEN
2    Canada   36503097    BIG  1529      CAD
3     Italy   60501718  SMALL  1850      EUR
4  Brazilia  208360000    BIG  1798     REAL